; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_1 ?v7 - type_1 ?v3 - type_3)
 	      (pred_4 ?v6 - object ?v3 - type_3)
	      (pred_3 ?v7 - type_1 ?v4 - type_2)
	      (pred_2 ?v7 - type_1 ?v6 - object ?v4 - type_2))

   (:action op_2
       :parameters  (?v7 - type_1 ?v8 ?v2 - type_3)
       :precondition (and  (pred_1 ?v7 ?v8))
       :effect (and  (pred_1 ?v7 ?v2)
		     (not (pred_1 ?v7 ?v8))))

   (:action op_3
       :parameters (?v7 - type_1 ?v5 - object ?v1 - type_3 ?v4 - type_2)
       :precondition  (and  (pred_4 ?v5 ?v1) (pred_1 ?v7 ?v1) (pred_3 ?v7 ?v4))
       :effect (and (pred_2 ?v7 ?v5 ?v4)
		    (not (pred_4 ?v5 ?v1)) 
		    (not (pred_3 ?v7 ?v4))))

   (:action op_1
       :parameters (?v7 - type_1 ?v5 - object ?v1 - type_3 ?v4 - type_2)
       :precondition  (and  (pred_2 ?v7 ?v5 ?v4) (pred_1 ?v7 ?v1))
       :effect (and (pred_4 ?v5 ?v1)
		    (pred_3 ?v7 ?v4)
		    (not (pred_2 ?v7 ?v5 ?v4)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_11 obj_01 - type_1
obj_14 obj_09 obj_13 obj_04 - type_2
obj_12 obj_08 obj_02 obj_07 - type_3
obj_03 obj_06 obj_05 obj_10 - object)
(:init
(pred_1 obj_11 obj_08)
(pred_3 obj_11 obj_14)
(pred_3 obj_11 obj_09)
(pred_1 obj_01 obj_07)
(pred_3 obj_01 obj_13)
(pred_3 obj_01 obj_04)
(pred_4 obj_03 obj_07)
(pred_4 obj_06 obj_07)
(pred_4 obj_05 obj_02)
(pred_4 obj_10 obj_07)
)
(:goal
(and
(pred_4 obj_03 obj_07)
(pred_4 obj_06 obj_07)
(pred_4 obj_05 obj_07)
(pred_4 obj_10 obj_12)
)
)

(:constraints
  (and
    (always (not (and (pred_1 obj_11 obj_07) (pred_1 obj_01 obj_07))))
  )
)
)

; plan
1. (op_3 obj_01 obj_10 obj_07 obj_04)
   deleted: (pred_4 obj_10 obj_07) (pred_3 obj_01 obj_04)
   added: (pred_2 obj_01 obj_10 obj_04)
   goals met: 2 of 4
2. (op_2 obj_11 obj_08 obj_02)
   deleted: (pred_1 obj_11 obj_08)
   added: (pred_1 obj_11 obj_02)
   goals met: 2 of 4
3. (op_2 obj_01 obj_07 obj_12)
   deleted: (pred_1 obj_01 obj_07)
   added: (pred_1 obj_01 obj_12)
   goals met: 2 of 4
4. (op_3 obj_11 obj_05 obj_02 obj_09)
   deleted: (pred_4 obj_05 obj_02) (pred_3 obj_11 obj_09)
   added: (pred_2 obj_11 obj_05 obj_09)
   goals met: 2 of 4
5. (op_2 obj_11 obj_02 obj_07)
   deleted: (pred_1 obj_11 obj_02)
   added: (pred_1 obj_11 obj_07)
   goals met: 2 of 4
6. (op_1 obj_01 obj_10 obj_12 obj_04)
   deleted: (pred_2 obj_01 obj_10 obj_04)
   added: (pred_4 obj_10 obj_12) (pred_3 obj_01 obj_04)
   goals met: 3 of 4
7. (op_1 obj_11 obj_05 obj_07 obj_09)
   deleted: (pred_2 obj_11 obj_05 obj_09)
   added: (pred_4 obj_05 obj_07) (pred_3 obj_11 obj_09)
   goals met: 4 of 4
